import json

import pandas as pd
import pytest

from src.reports import spending_by_category


def test_spending_by_category():
    # Создаем тестовый датафрейм
    data = {
        "Дата операции": [
            "09.08.2024 13:03:51",
            "09.08.2024 12:20:41",
            "08.08.2024 21:51:06",
            "07.08.2024 22:07:07",
            "02.08.2024 12:36:06",
        ],
        "Дата платежа": ["09.08.2024", "09.08.2024", "08.08.2024", "08.08.2024", "02.08.2024"],
        "Номер карты": ["*4467", "*4467", "*4467", "*4467", "*4467"],
        "Статус": ["OK", "OK", "OK", "OK", "OK"],
        "Сумма операции": [-586.92, -1863.78, -223.76, -516.95, -1035.0],
        "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB"],
        "Сумма платежа": [-586.92, -1863.78, -223.76, -516.95, -1035.0],
        "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "RUB"],
        "Кэшбэк": [None, None, None, None, None],
        "Категория": ["Супермаркеты", "Супермаркеты", "Супермаркеты", "Супермаркеты", "Супермаркеты"],
        "MCC": [5411.0, 5411.0, 5411.0, 5411.0, 5411.0],
        "Описание": ["Магнит", "Магнит", "Красное и белое", "Магнит", "ВкусВилл"],
        "Бонусы (включая кэшбэк)": [0, 0, 0, 0, 0],
        "Округление на инвесткопилку": [0, 0, 0, 0, 0],
        "Сумма операции с округлением": [586.92, 1863.78, 223.76, 516.95, 1035.0],
    }
    transactions = pd.DataFrame(data)

    # Вызываем функцию
    result = spending_by_category(transactions, "Супермаркеты", "03.08.2024")

    # Преобразуем результат из JSON в словарь
    result_dict = json.loads(result)

    # Проверяем результат
    expected_result = [
        {
            "Дата операции": "02.08.2024 12:36:06",
            "Дата платежа": "02.08.2024",
            "Номер карты": "*4467",
            "Статус": "OK",
            "Сумма операции": -1035.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1035.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "ВкусВилл",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1035.0,
        }
    ]

    assert result_dict == expected_result


if __name__ == "__main__":
    pytest.main()
